**`nomis-test`** terraform plan on `pull_request` event [#3377](https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4263301780)

```
Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.cert_expires_in_2_days will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_2_days" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "cert-expires-in-2-days"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.cert_expires_in_30_days will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_30_days" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "cert-expires-in-30-days"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_dns will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_dns" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "load-balancer-unhealthy-state-dns"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_routing will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_routing" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "load-balancer-unhealthy-state-routing"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_target will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_target" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "load-balancer-unhealthy-state-target"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu-usage-iowait"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-cpu-usage-iowait"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu-utilization"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-cpu-utilization"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["disk-used-percent"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-disk-used-percent"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["high-memory-usage"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-high-memory-usage"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["instance-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-instance-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle-batch-error"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-oracle-batch-error"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle-db-disconnected"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-oracle-db-disconnected"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["system-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-1-system-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["cpu-usage-iowait"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-cpu-usage-iowait"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["cpu-utilization"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-cpu-utilization"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["disk-used-percent"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-disk-used-percent"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["high-memory-usage"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-high-memory-usage"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["instance-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-instance-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-batch-error"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-oracle-batch-error"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["oracle-db-disconnected"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-oracle-db-disconnected"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-2"].aws_cloudwatch_metric_alarm.this["system-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-db-2-system-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu-usage-iowait"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-cpu-usage-iowait"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu-utilization"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-cpu-utilization"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["disk-used-percent"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-disk-used-percent"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["high-memory-usage"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-high-memory-usage"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["instance-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-instance-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle-batch-error"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-oracle-batch-error"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle-db-disconnected"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-oracle-db-disconnected"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t3-nomis-db-1"].aws_cloudwatch_metric_alarm.this["system-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t3-nomis-db-1-system-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["disk-free-windows"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "jumpserver-2022-disk-free-windows"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["high-cpu-windows"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "jumpserver-2022-high-cpu-windows"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["low-available-memory-windows"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "jumpserver-2022-low-available-memory-windows"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1-nomis-web"].aws_cloudwatch_metric_alarm.this["cpu-usage-iowait"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-web-cpu-usage-iowait"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1-nomis-web"].aws_cloudwatch_metric_alarm.this["cpu-utilization"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-web-cpu-utilization"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1-nomis-web"].aws_cloudwatch_metric_alarm.this["disk-used-percent"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-web-disk-used-percent"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1-nomis-web"].aws_cloudwatch_metric_alarm.this["high-memory-usage"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-web-high-memory-usage"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1-nomis-web"].aws_cloudwatch_metric_alarm.this["instance-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-web-instance-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1-nomis-web"].aws_cloudwatch_metric_alarm.this["system-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1-nomis-web-system-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1a-nomis-web"].aws_cloudwatch_metric_alarm.this["cpu-usage-iowait"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1a-nomis-web-cpu-usage-iowait"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1a-nomis-web"].aws_cloudwatch_metric_alarm.this["cpu-utilization"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1a-nomis-web-cpu-utilization"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1a-nomis-web"].aws_cloudwatch_metric_alarm.this["disk-used-percent"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1a-nomis-web-disk-used-percent"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1a-nomis-web"].aws_cloudwatch_metric_alarm.this["high-memory-usage"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1a-nomis-web-high-memory-usage"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1a-nomis-web"].aws_cloudwatch_metric_alarm.this["instance-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1a-nomis-web-instance-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.ec2_weblogic_autoscaling_group["t1a-nomis-web"].aws_cloudwatch_metric_alarm.this["system-health-check-failed"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "this" {
      ~ alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
          + "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms",
        ]
        id                        = "t1a-nomis-web-system-health-check-failed"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.pagerduty_core_alerts.aws_sns_topic_subscription.pagerduty_subscription["nomis_alarms"] will be destroyed
  # (because aws_sns_topic_subscription.pagerduty_subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "pagerduty_subscription" {
      - arn                             = "arn:aws:sns:eu-west-2:612659970365:nomis_alarms:d8c0d4fa-936c-48f2-827a-ebd8eba58965" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = false -> null
      - delivery_policy                 = "" -> null
      - endpoint                        = (sensitive value) -> null
      - endpoint_auto_confirms          = false -> null
      - filter_policy                   = "" -> null
      - filter_policy_scope             = "" -> null
      - id                              = "arn:aws:sns:eu-west-2:612659970365:nomis_alarms:d8c0d4fa-936c-48f2-827a-ebd8eba58965" -> null
      - owner_id                        = "612659970365" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "https" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = "" -> null
      - subscription_role_arn           = "" -> null
      - topic_arn                       = "arn:aws:sns:eu-west-2:612659970365:nomis_alarms" -> null
    }

  # module.pagerduty_integration_nonprod.aws_sns_topic_subscription.pagerduty_subscription["nomis_nonprod_alarms"] will be created
  + resource "aws_sns_topic_subscription" "pagerduty_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:612659970365:nomis_nonprod_alarms"
    }

  # module.pagerduty_integration_prod.aws_sns_topic_subscription.pagerduty_subscription["nomis_alarms"] will be created
  + resource "aws_sns_topic_subscription" "pagerduty_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:612659970365:nomis_alarms"
    }

Plan: 2 to add, 44 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
